; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	image1 - mode
	thermograph0 - mode
	thermograph2 - mode
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon18)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument7 thermograph0)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 thermograph2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(pointing satellite4 Star8)
	(have_image Star3 image1)
	(have_image Star4 thermograph0)
	(have_image Star5 thermograph2)
	(have_image Star8 thermograph2)
	(have_image Planet9 thermograph0)
	(have_image Star10 thermograph2)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 thermograph0)
	(have_image Phenomenon14 thermograph0)
	(have_image Planet15 image1)
	(have_image Phenomenon16 thermograph2)
	(have_image Planet17 thermograph2)
	(have_image Phenomenon18 thermograph2)
	(have_image Planet19 thermograph2)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 17
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 17
3. (turn_to satellite4 groundstation0 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 groundstation0)
   goals met: 0 of 17
4. (calibrate satellite4 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 0 of 17
5. (turn_to satellite4 phenomenon13 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon13)
   goals met: 0 of 17
6. (take_image satellite4 phenomenon13 instrument7 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 1 of 17
7. (turn_to satellite4 phenomenon14 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon14)
   goals met: 1 of 17
8. (take_image satellite4 phenomenon14 instrument7 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 2 of 17
9. (turn_to satellite4 phenomenon16 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon16)
   goals met: 2 of 17
10. (take_image satellite4 phenomenon16 instrument7 thermograph2)
   added: (have_image phenomenon16 thermograph2)
   goals met: 3 of 17
11. (turn_to satellite4 phenomenon18 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon18)
   goals met: 3 of 17
12. (take_image satellite4 phenomenon18 instrument7 thermograph2)
   added: (have_image phenomenon18 thermograph2)
   goals met: 4 of 17
13. (turn_to satellite4 planet17 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 planet17)
   goals met: 4 of 17
14. (take_image satellite4 planet17 instrument7 thermograph2)
   added: (have_image planet17 thermograph2)
   goals met: 5 of 17
15. (turn_to satellite4 planet19 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet19)
   goals met: 5 of 17
16. (take_image satellite4 planet19 instrument7 thermograph2)
   added: (have_image planet19 thermograph2)
   goals met: 6 of 17
17. (turn_to satellite4 planet9 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet9)
   goals met: 6 of 17
18. (take_image satellite4 planet9 instrument7 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 7 of 17
19. (turn_to satellite4 star10 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star10)
   goals met: 7 of 17
20. (take_image satellite4 star10 instrument7 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 8 of 17
21. (turn_to satellite4 star4 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star4)
   goals met: 8 of 17
22. (take_image satellite4 star4 instrument7 thermograph0)
   added: (have_image star4 thermograph0)
   goals met: 9 of 17
23. (turn_to satellite4 star5 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star5)
   goals met: 9 of 17
24. (take_image satellite4 star5 instrument7 thermograph2)
   added: (have_image star5 thermograph2)
   goals met: 10 of 17
25. (turn_to satellite4 star8 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 star8)
   goals met: 11 of 17
26. (take_image satellite4 star8 instrument7 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 12 of 17
27. (turn_to satellite1 groundstation1 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation1)
   goals met: 13 of 17
28. (turn_to satellite0 groundstation2 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 groundstation2)
   goals met: 13 of 17
29. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 13 of 17
30. (turn_to satellite0 phenomenon11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon11)
   goals met: 13 of 17
31. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 14 of 17
32. (turn_to satellite0 phenomenon12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon12)
   goals met: 14 of 17
33. (take_image satellite0 phenomenon12 instrument0 image1)
   added: (have_image phenomenon12 image1)
   goals met: 15 of 17
34. (turn_to satellite0 planet15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet15)
   goals met: 15 of 17
35. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 16 of 17
36. (turn_to satellite0 star3 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star3)
   goals met: 16 of 17
37. (take_image satellite0 star3 instrument0 image1)
   added: (have_image star3 image1)
   goals met: 17 of 17
